#### Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd

In [3]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=("var1","var2","var3"))
df

   var1  var2  var3
0    28    25    20
1    18    19    28
2    13    16     1
3    21    17    18
4    12     8    12
5    11    20     3
6    23    24     6
7    22    16    27
8    19    24    13
9     1     8    11

In [4]:
df["var1"]

0    28
1    18
2    13
3    21
4    12
5    11
6    23
7    22
8    19
9     1
Name: var1, dtype: int32

In [7]:
df["var1"][0:2]

0    28
1    18
Name: var1, dtype: int32

In [8]:
df[0:2][["var1","var2"]]

   var1  var2
0    28    25
1    18    19

In [16]:
df[df["var1"] > 15]["var1"] # dataframe içerisinde var1 değerleri 15den 
# büyük olan var1 değerlerini getir.

0    28
1    18
3    21
6    23
7    22
8    19
Name: var1, dtype: int32

In [20]:
df[(df.var1 > 15) & (df.var3 < 12)] # var1'i 15 den büyük var3'ü 12 den küçük olan kayıtları getir.

   var1  var2  var3
6    23    24     6

In [22]:
df.loc[(df.var1 > 20), ["var1","var2"]]

   var1  var2
0    28    25
3    21    17
6    23    24
7    22    16

In [23]:
df.loc[(df.var1 > 20)][["var1","var2"]]

   var1  var2
0    28    25
3    21    17
6    23    24
7    22    16